# Section 2 자료구조 : Series와 Dataframe

## Section 2.1 : Series

- Series 구조

In [1]:
#### import
from pandas import Series, DataFrame
import pandas as pd

#### series
fruit = Series([2500, 3800, 1200, 6000],
              index = ['apple', 'banana', 'peer', 'cherry'])
print(fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

- 특정값 추출 values, index

In [2]:
#### values index
fruit = Series([2500, 3800, 1200, 6000],
              index = ['apple', 'banana', 'peer', 'cherry'])
print(fruit.values)
print(fruit.index)

[2500 3800 1200 6000]
Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

- 특정값 추출 values, index

In [5]:
#### Series()
fruitData = {'apple':2500, 'banana':3800, 'peer':1200, 'cherry':6000}
fruit = Series(fruitData)
print(type(fruitData))
print(type(fruit))

<class 'dict'>
<class 'pandas.core.series.Series'>

- Value와 index 이름 지정하기 name

In [6]:
#### name
fruit = Series([2500, 3800, 1200, 6000],
              index = ['apple', 'banana', 'peer', 'cherry'])
fruit.name = 'fruitPrice'
fruit.index.name = 'fruitName'
print(fruit)

fruitName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

## Section 2.2 : Dataframe

- Dataframe 구조

In [7]:
##### Dataframe()
fruitData = {'fruitName' : ["apple", 'banan', 'cherry','peer'],
            'fruitPrice' : [2500, 3800, 6000, 1200],
            'num' : [10, 5, 3, 8]}

fruitFrame = DataFrame(fruitData)
fruitFrame

  fruitName  fruitPrice  num
0     apple        2500   10
1     banan        3800    5
2    cherry        6000    3
3      peer        1200    8

- 칼럼순서 지정하기 columns

In [9]:
#### columns
fruitData = {'fruitName' : ["apple", 'banan', 'cherry','peer'],
            'fruitPrice' : [2500, 3800, 6000, 1200],
            'num' : [10, 5, 3, 8]}
fruitFrame = DataFrame(fruitData, columns=['fruitPrice', 'num', 'fruitName'])
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5     banan
2        6000    3    cherry
3        1200    8      peer

- 특정항목 추출하기

In [10]:
####사전형식
fruitFrame['fruitName']

0     apple
1     banan
2    cherry
3      peer
Name: fruitName, dtype: object

In [11]:
###속성형식
fruitFrame.fruitName

0     apple
1     banan
2    cherry
3      peer
Name: fruitName, dtype: object

- 컬럼 추가하기

In [13]:
#### 컬럼추가하기 - 같은 ㄱ밧
fruitFrame['year'] = 2016
fruitFrame

   fruitPrice  num fruitName  year
0        2500   10     apple  2016
1        3800    5     banan  2016
2        6000    3    cherry  2016
3        1200    8      peer  2016

In [14]:
#####컬럼 추가하기 - 다른값
variable = Series([4,2,1], index=[0,2,3])
fruitFrame['stock'] = variable
fruitFrame

   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2016    4.0
1        3800    5     banan  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      peer  2016    1.0

# Section3 자료 다루기
## Section 3.1 : 데이터 구조의 항목삭제

- Series 데이터 row 삭제하기 drop()

In [19]:
#### row 삭제하기 drop()
fruit = Series([2500, 3800, 1200, 6000],
              index = ['apple', 'banana', 'peer', 'cherry'])
new_fruit = fruit.drop('banana')
print(fruit)
print("*"*20)
print(new_fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64
********************
apple     2500
peer      1200
cherry    6000
dtype: int64

- Dataframe row 삭제하기 drop()

In [36]:
#### row 삭제하기 drop()
fruitData = {'fruitName' : ["apple", 'banana', 'cherry','peer'],
            'fruitPrice' : [2500, 3800, 6000, 1200],
            'num' : [10, 5, 3, 8]}
fruitName = fruitData['fruitName']
fruitFrame = DataFrame(fruitData, index = fruitName,
                      columns=['fruitPrice', 'num'])
fruitFrame2 = fruitFrame.drop(['apple', 'cherry'])

In [37]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [38]:
fruitFrame2

        fruitPrice  num
banana        3800    5
peer          1200    8

- Dataframe column 삭제하기 drop()

In [39]:
#### columns 삭제하기 drop()
fruitFrame3 = fruitFrame.drop('num', axis = 1)

In [40]:
fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [41]:
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

## Section 3.2 : 항목 추출하기 Slice

- Series의 Slice

In [42]:
#### Series Slice
fruit = Series([2500, 3800, 1200, 6000],
               index = ["apple", 'banana', 'peer','cherry'])

fruit['apple':'peer']

apple     2500
banana    3800
peer      1200
dtype: int64

- Dataframe의 slice

In [45]:
####Dataframe Slice
#### row 삭제하기 drop()
fruitData = {'fruitName' : ["apple", 'banana', 'cherry','peer'],
            'fruitPrice' : [2500, 3800, 6000, 1200],
            'num' : [10, 5, 3, 8]}
fruitName = fruitData['fruitName']
fruitFrame = DataFrame(fruitData, index = fruitName,
                      columns=['fruitPrice', 'num'])
fruitFrame['fruitPrice']

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

In [46]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

## Section 3.3 : 데이터의 기본연산

- Sereis의 연산

In [48]:
#### Sereis 연산
fruit1 = Series([5,9,10,3], index = ["apple", 'banana', 'cherry','peer'])
fruit2 = Series([3,2,9,5,10], index = ["apple","orange", 'banana', 'cherry','mango'])
print(fruit1)
print("*"*20)
print(fruit2)

apple      5
banana     9
cherry    10
peer       3
dtype: int64
********************
apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

In [49]:
fruit1 + fruit2

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

- Dataframe의 연산

In [56]:
#### Datafrmae연산
fruitData1 = {"Ohio":[4,8,3,5], 'Texas':[0,1,2,3]}
fruitFrame1 = DataFrame(fruitData1, columns=['Ohio', 'Texas'],
                       index = ["apple", 'banana', 'cherry','peer'])
fruitData2 = {"Ohio":[3,0,2,1,7], 'Colorado':[5,4,3,6,0]}
fruitFrame2 = DataFrame(fruitData2, columns=['Ohio', 'Colorado'],
                       index = ["apple","orange", 'banana', 'cherry','mango'])

In [57]:
fruitFrame1

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3

In [58]:
fruitFrame2

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [59]:
fruitFrame1 + fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

## Section 3.4 : 데이터의 정렬

- Sereis의 정렬

In [60]:
#### Sereis 정렬
fruit = Series([2500, 3800, 1200, 6000], index = ["apple", 'banana', 'cherry','peer'])
fruit.sort_values(ascending = False)

peer      6000
banana    3800
apple     2500
cherry    1200
dtype: int64

- Dataframe의 정렬

In [64]:
####Dataframe 정렬
fruitData = {'fruitName' : ['peer', 'banana', 'apple', 'cherry'],
            'fruitPrice' : [2500, 3800, 6000, 1200],
            'num' : [10, 5, 3, 8]}
fruitName = fruitData['fruitName']
fruitFrame = DataFrame(fruitData, index = fruitName,
                      columns=['num', 'fruitPrice'])
fruitFrame

        num  fruitPrice
peer     10        2500
banana    5        3800
apple     3        6000
cherry    8        1200

In [65]:
fruitFrame.sort_index()

        num  fruitPrice
apple     3        6000
banana    5        3800
cherry    8        1200
peer     10        2500

In [66]:
fruitFrame.sort_index(axis = 1)

        fruitPrice  num
peer          2500   10
banana        3800    5
apple         6000    3
cherry        1200    8

- Dataframe의 값 정렬

In [67]:
#### Dataframe 값 정렬
fruitFrame.sort_values(by = ['fruitPrice'])

        num  fruitPrice
cherry    8        1200
peer     10        2500
banana    5        3800
apple     3        6000

# Section 4 : 기초분석
## Section 4.1 : 기술통계량

- German credit data 입력

In [68]:
#### PANDAS를 이용한 데이터 입력
german = pd.read_csv("german_credit.csv")
list(german.columns.values)

['Creditability',
 'Account Balance',
 'Duration of Credit (month)',
 'Payment Status of Previous Credit',
 'Purpose',
 'Credit Amount',
 'Value Savings/Stocks',
 'Length of current employment',
 'Instalment per cent',
 'Sex & Marital Status',
 'Guarantors',
 'Duration in Current address',
 'Most valuable available asset',
 'Age (years)',
 'Concurrent Credits',
 'Type of apartment',
 'No of Credits at this Bank',
 'Occupation',
 'No of dependents',
 'Telephone',
 'Foreign Worker']

- 기초통계분석

In [69]:
#### min
german.min()

Creditability                          0
Account Balance                        1
Duration of Credit (month)             4
Payment Status of Previous Credit      0
Purpose                                0
Credit Amount                        250
Value Savings/Stocks                   1
Length of current employment           1
Instalment per cent                    1
Sex & Marital Status                   1
Guarantors                             1
Duration in Current address            1
Most valuable available asset          1
Age (years)                           19
Concurrent Credits                     1
Type of apartment                      1
No of Credits at this Bank             1
Occupation                             1
No of dependents                       1
Telephone                              1
Foreign Worker                         1
dtype: int64

In [70]:
#### max
german.max()

Creditability                            1
Account Balance                          4
Duration of Credit (month)              72
Payment Status of Previous Credit        4
Purpose                                 10
Credit Amount                        18424
Value Savings/Stocks                     5
Length of current employment             5
Instalment per cent                      4
Sex & Marital Status                     4
Guarantors                               3
Duration in Current address              4
Most valuable available asset            4
Age (years)                             75
Concurrent Credits                       3
Type of apartment                        3
No of Credits at this Bank               4
Occupation                               4
No of dependents                         2
Telephone                                2
Foreign Worker                           2
dtype: int64

In [71]:
#### mean
german.mean()

Creditability                           0.700
Account Balance                         2.577
Duration of Credit (month)             20.903
Payment Status of Previous Credit       2.545
Purpose                                 2.828
Credit Amount                        3271.248
Value Savings/Stocks                    2.105
Length of current employment            3.384
Instalment per cent                     2.973
Sex & Marital Status                    2.682
Guarantors                              1.145
Duration in Current address             2.845
Most valuable available asset           2.358
Age (years)                            35.542
Concurrent Credits                      2.675
Type of apartment                       1.928
No of Credits at this Bank              1.407
Occupation                              2.904
No of dependents                        1.155
Telephone                               1.404
Foreign Worker                          1.037
dtype: float64

In [74]:
####요약 통계량 describe()
german.describe()

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.00000,...,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,0.700000,2.577000,20.903000,2.54500,2.828000,3271.24800,2.105000,3.384000,2.973000,2.68200,...,2.845000,2.358000,35.54200,2.675000,1.928000,1.407000,2.904000,1.155000,1.404000,1.037000
std,0.458487,1.257638,12.058814,1.08312,2.744439,2822.75176,1.580023,1.208306,1.118715,0.70808,...,1.103718,1.050209,11.35267,0.705601,0.530186,0.577654,0.653614,0.362086,0.490943,0.188856
min,0.000000,1.000000,4.000000,0.00000,0.000000,250.00000,1.000000,1.000000,1.000000,1.00000,...,1.000000,1.000000,19.00000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,0.000000,1.000000,12.000000,2.00000,1.000000,1365.50000,1.000000,3.000000,2.000000,2.00000,...,2.000000,1.000000,27.00000,3.000000,2.000000,1.000000,3.000000,1.000000,1.000000,1.000000
50%,1.000000,2.000000,18.000000,2.00000,2.000000,2319.50000,1.000000,3.000000,3.000000,3.00000,...,3.000000,2.000000,33.00000,3.000000,2.000000,1.000000,3.000000,1.000000,1.000000,1.000000
75%,1.000000,4.000000,24.000000,4.00000,3.000000,3972.25000,3.000000,5.000000,4.000000,3.00000,...,4.000000,3.000000,42.00000,3.000000,2.000000,2.000000,3.000000,1.000000,2.000000,1.000000
max,1.000000,4.000000,72.000000,4.00000,10.000000,18424.00000,5.000000,5.000000,4.000000,4.00000,...,4.000000,4.000000,75.00000,3.000000,3.000000,4.000000,4.000000,2.000000,2.000000,2.000000


## Section 4.2 상관관계와 공분산

- 상관관계와 공분산

In [75]:
#### corr cov
german = pd.read_csv("german_credit.csv")
german_sample = german[["Duration of Credit (month)", "Credit Amount",
                       "Age (years)"]]
german_sample.corr()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),1.000000,0.624988,-0.037550
Credit Amount,0.624988,1.000000,0.032273
Age (years),-0.037550,0.032273,1.000000

In [76]:
german_sample.cov()

,Duration of Credit (month),Credit Amount,Age (years)
Duration of Credit (month),145.415006,2.127401e+04,-5.140567
Credit Amount,21274.007063,7.967927e+06,1034.202787
Age (years),-5.140567,1.034203e+03,128.883119

## Section 5 : 핵심기능 Group by

## Section 5.1 Group by를 이용한 계산 및 요약통계

- 한개 그룹 요약통계

In [82]:
german_grouped = german['Credit Amount'].groupby(german['Type of apartment'])
german_grouped.mean()

Type of apartment
1    3122.553073
2    3067.257703
3    4881.205607
Name: Credit Amount, dtype: float64

- 두개 그룹 요약 통계

In [84]:
german_grouped2 = german['Credit Amount'].groupby([german['Purpose'],
                                                 german['Type of apartment']])
german_grouped2.mean()

Purpose  Type of apartment
0        1                    2597.225000
         2                    2811.024242
         3                    5138.689655
1        1                    5037.086957
         2                    4915.222222
         3                    6609.923077
2        1                    2727.354167
         2                    3107.450820
         3                    4100.181818
3        1                    2199.763158
         2                    2540.533040
         3                    2417.333333
4        1                    1255.500000
         2                    1546.500000
5        1                    1522.000000
         2                    2866.000000
         3                    2750.666667
6        1                    3156.444444
         2                    2492.423077
         3                    4387.266667
8        1                     902.000000
         2                    1243.875000
9        1                    5614.125000
         2                    3800.592105
         3                    4931.800000
10       2                    8576.111111
         3                    7109.000000
Name: Credit Amount, dtype: float64

## Section 5.2 : Group간 반복하기

- 한 개 그룹반복

In [93]:
#### group 한 개 반복
german_sample = german[['Type of apartment',
                       'Sex & Marital Status',
                       'Credit Amount']]
for type, group in german_sample.groupby('Type of apartment'):
    print(type)
    print(group.head(n = 3))
    print("*"*50)

1
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
1                  1                     3           2799
2                  1                     2            841
**************************************************
2
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
**************************************************
3
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032
**************************************************

- 두개 그룹반복

In [94]:
#### group 두개 반복
for (type, sex), group in german_sample.groupby(['Type of apartment',
                                                'Sex & Marital Status']):
    print((type, sex))
    print(group.head(n=3))
    print("*"*50)

(1, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
369                  1                     1           3021
777                  1                     1           3384
797                  1                     1           2319
**************************************************
(1, 2)
   Type of apartment  Sex & Marital Status  Credit Amount
0                  1                     2           1049
2                  1                     2            841
9                  1                     2           3758
**************************************************
(1, 3)
   Type of apartment  Sex & Marital Status  Credit Amount
1                  1                     3           2799
3                  1                     3           2122
5                  1                     3           2241
**************************************************
(1, 4)
    Type of apartment  Sex & Marital Status  Credit Amount
11                  1                     4           6187
14                  1                     4           1936
17                  1                     4           3213
**************************************************
(2, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
50                   2                     1            640
97                   2                     1           4455
112                  2                     1           2366
**************************************************
(2, 2)
    Type of apartment  Sex & Marital Status  Credit Amount
8                   2                     2           1098
12                  2                     2           1957
33                  2                     2           1376
**************************************************
(2, 3)
   Type of apartment  Sex & Marital Status  Credit Amount
4                  2                     3           2171
6                  2                     3           3398
7                  2                     3           1361
**************************************************
(2, 4)
    Type of apartment  Sex & Marital Status  Credit Amount
48                  2                     4           1474
57                  2                     4           1053
78                  2                     4           1602
**************************************************
(3, 1)
     Type of apartment  Sex & Marital Status  Credit Amount
620                  3                     1           9277
749                  3                     1           2892
784                  3                     1           2149
**************************************************
(3, 2)
     Type of apartment  Sex & Marital Status  Credit Amount
423                  3                     2           2133
453                  3                     2           5743
467                  3                     2           5324
**************************************************
(3, 3)
    Type of apartment  Sex & Marital Status  Credit Amount
29                  3                     3           4796
44                  3                     3           1239
69                  3                     3           2032
**************************************************
(3, 4)
     Type of apartment  Sex & Marital Status  Credit Amount
125                  3                     4           5103
**************************************************